Revit 2026 API

# TableSectionDataHideSection Property

---

Whether or not the section is hidden.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HideSection { get; set; }
```
```vb
Public Property HideSection As Boolean
	Get
	Set
```
```cpp
public:
property bool HideSection {
	bool get ();
	void set (bool value);
}
```
```fsharp
member HideSection : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: This operation is forbidden for cells in standard schedule body sections. |

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace